# Задача 2: Найдите сумму цифр трехзначного числа.
# *Пример:*
# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0) |

print('Введите трехзначное число')
a = int(input())
first = a//100
third = a % 10
second = (a//10) % 10
sum = first + third +second
print(sum)